In [1]:
import pandas as pd

In [4]:
people = {
    "이름" : ['길동', '춘향', '몽룡'],
    "성" : ['홍', '성', '이'],
    "이메일" : ["gdhong@gmail.com", "chsung@gmail.com", "mrlee@gmail.com"]
}

In [5]:
df = pd.DataFrame(people)

In [6]:
df

   이름  성               이메일
0  길동  홍  gdhong@gmail.com
1  춘향  성  chsung@gmail.com
2  몽룡  이   mrlee@gmail.com

Index(['이름', '성', '이메일'], dtype='object')
칼럼 이름을 변경해보자

In [7]:
df.columns = ['first_name', 'last_name', 'email']

In [8]:
df

  first_name last_name             email
0         길동         홍  gdhong@gmail.com
1         춘향         성  chsung@gmail.com
2         몽룡         이   mrlee@gmail.com

In [9]:
nums = [x for x in range(1, 10)]

In [10]:
nums

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [11]:
n1 = 3
n2 = 5 
n1, n2 = n2, n1

In [15]:
n1

5

In [16]:
n2

3

In [17]:
"first_name".upper()

'FIRST_NAME'

In [18]:
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [19]:
df.columns = [x.upper() for x in df.columns]

In [20]:
df

  FIRST_NAME LAST_NAME             EMAIL
0         길동         홍  gdhong@gmail.com
1         춘향         성  chsung@gmail.com
2         몽룡         이   mrlee@gmail.com

In [21]:
'Hello Word!'.replace("Hello", "Hi")

'Hi Word!'

칼럼 이름의 "_" 를 " " 변경해보자

In [24]:
df.columns.str.replace("_", " ")

Index(['FIRST NAME', 'LAST NAME', 'EMAIL'], dtype='object')

In [25]:
df

  FIRST_NAME LAST_NAME             EMAIL
0         길동         홍  gdhong@gmail.com
1         춘향         성  chsung@gmail.com
2         몽룡         이   mrlee@gmail.com

원본의 칼럼 명을 변경하고싶다면 다음과 같이

In [26]:
df.columns = df.columns.str.replace("_", " ")

In [27]:
df

  FIRST NAME LAST NAME             EMAIL
0         길동         홍  gdhong@gmail.com
1         춘향         성  chsung@gmail.com
2         몽룡         이   mrlee@gmail.com

칼럼 이름을 소문자로 변경하라 .lower()

In [29]:
df.columns = [x.lower() for x in df.columns]

In [30]:
df

  first name last name             email
0         길동         홍  gdhong@gmail.com
1         춘향         성  chsung@gmail.com
2         몽룡         이   mrlee@gmail.com